# IsSavedInCurrentVersion Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BasicFileInfo..::..IsSavedInCurrentVersion Property
BasicFileInfo Class See Also
---
Checks if the file is saved in the current version.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public bool IsSavedInCurrentVersion { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsSavedInCurrentVersion As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsSavedInCurrentVersion {
	bool get ();
}
```

# See Also
BasicFileInfo Class
Autodesk.Revit.DB Namespace